Repository: andrearoggeri22/VitaLink
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: it

source: Connection Date
it: Data di Connessione

source: Token Expiration
it: Scadenza Token

source: Status
it: Stato

source: No Active Connection
it: Nessuna Connessione Attiva

source: This patient does not have an active connection to a health platform.
it: Questo paziente non ha una connessione attiva a una piattaforma sanitaria

source: Click the Health Sync button above to connect to a health platform and automatically collect vital signs data.
it: Clicca il pulsante Health Sync sopra per connetterti a una piattaforma sanitaria e raccogliere automaticamente i dati sui parametri vitali

source: Complete Report (Auto-select all)
it: Report Completo (Seleziona tutto)

source: Specific Parameter Reports
it: Reports Parametri Specifici

source: Vital Signs Trends
it: Andamento Parametri Vitali

source: Display Period
it: Mostra Periodo

source: Day
it: Giorno

source: Days
it: Giorni

source: Month
it: Mese

source: Months
it: Mesi

source: Connect to a health platform to view data.
it: Connettiti a una piattaforma sanitaria per visualizzare i dati

source: Observations for Current Period
it: Osservazioni per il Periodo Corrente

source: Add Observation
it: Aggiungi Osservazione

source: Loading observations...
it: Caricamento osservazioni...

source: No observations for the current period.
it: Nessuna osservazione per il periodo corrente

source: Vital Signs History
it: Storico Parametri Vitali

source: Type
it: Tipo

source: Value
it: Valore

source: Source
it: Sorgente

source: Loading data...
it: Caricamento dati...

source: Vital Parameter
it: Parametro Vitale

source: Are you sure you want to delete this observation?
it: Sei sicuro di voler eliminare questa osservazione?

source: Save
it: Salva

source: Generate Specific Report
it: Genera Report Specifico

source: Create a customized report by selecting specific elements to include:
it: Crea un report personalizzato selezionando gli elementi specifici da includere:

source: Add an optional summary for this report.
it: Aggiungi un riepilogo facoltativo per questo report

source: This summary will only be included in this report and will not be saved for future reference.
it: Questo riepilogo sarà incluso solo in questo report e non sarà salvato per riferimenti futuri

source: Select notes to include in the report:
it: Seleziona le note da includere nel report:

source: Deselect All
it: Deseleziona Tutto

source: Loading notes...
it: Caricamento note...

source: Select vital sign types to include:
it: Seleziona i tipi di parametri vitali da includere:

source: Select time periods for charts:
it: Seleziona il periodo temporale per i grafici:

source: 1 Year
it: 1 Anno

source: Select observations:
it: Seleziona osservazioni:

source: Generate Report
it: Genera Report
