Repository: andrearoggeri22/VitaLink
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: it

source: Invalid UUID format
it: Formato UUID non valido

source: Patient not found
it: Paziente non trovato

source: You are not authorized to access this patient
it: Non sei autorizzato ad accedere a questo paziente

source: Patient does not have a health platform connection
it: Il paziente non è connesso alla piattaforma sanitaria

source: Failed to retrieve health platform data
it: Impossibile recuperare i dati dalla piattaforma sanitaria

source: Missing JSON in request
it: JSON mancante nella richiesta

source: Note content cannot be empty
it: Il contenuto della nota non può essere vuoto

source: Note added successfully
it: Nota aggiunta con successo

source: An error occurred while adding the note
it: Si è verificato un errore durante l'aggiunta della nota

source: Note not found
it: Nota non trovata

source: You can only delete notes you have created
it: Puoi eliminare solo le note che hai creato

source: Note deleted successfully
it: Nota eliminata con successo

source: An error occurred while deleting the note
it: Si è verificato un errore durante l'eliminazione della nota

source: Invalid start_date format. Use ISO format (YYYY-MM-DD)
it: Formato data_inizio non valido. Usa il formato ISO (YYYY-MM-DD)

source: Invalid end_date format. Use ISO format (YYYY-MM-DD)
it: Formato data_fine non valido. Usa il formato ISO (YYYY-MM-DD)

source: Invalid vital sign type. Must be one of: %(types)s
it: Tipo di parametro vitale non valido. Deve essere uno tra: %(types)s

source: Missing required field: %(field)s
it: Campo obbligatorio mancante: %(field)s

source: Start date must be before end date
it: La data di inizio deve essere precedente alla data di fine

source: Observation added successfully
it: Osservazione aggiunta con successo

source: An error occurred while adding the observation
it: Si è verificato un errore durante l'aggiunta dell'osservazione

source: Observation not found
it: Osservazione non trovata

source: You are not authorized to modify this observation
it: Non sei autorizzato a modificare questa osservazione

source: Observation updated successfully
it: Osservazione aggiornata con successo

source: An error occurred while updating the observation
it: Si è verificato un errore durante l'aggiornamento dell'osservazione

source: You are not authorized to delete this observation
it: Non sei autorizzato a eliminare questa osservazione

source: Observation deleted successfully
it: Osservazione eliminata con successo

source: An error occurred while deleting the observation
it: Si è verificato un errore durante l'eliminazione dell'osservazione

source: Patient UUID is required
it: UUID del paziente obbligatorio

source: Patient is already associated with your account
it: Il paziente è già associato al tuo account

source: Patient imported successfully
it: Paziente importato con successo

source: A database error occurred while importing the patient
it: Si è verificato un errore di database durante l'importazione del paziente

source: An error occurred while importing the patient
it: Si è verificato un errore durante l'importazione del paziente

source: Error during action filtering: %(error)s
it: Errore durante il filtraggio delle azioni: %(error)s

source: Error during entity filtering: %(error)s
it: Errore durante il filtraggio delle entità: %(error)s

source: First Name
it: Nome

source: Last Name
it: Cognome

source: Specialty
it: Specializzazione

source: Password must be at least 8 characters long
it: La password deve contenere almeno 8 caratteri

source: Confirm Password
it: Conferma Password

source: Passwords do not match
it: Le password non corrispondono

source: An account with this Email already exists
it: Un account con questa email esiste già

source: Registration completed. Now you can access
it: Registrazione completata. Ora puoi accedere

source: An error occurred. Please try again
it: Errore. Per favore riprova

source: Please provide both email and password
it: Inserire sia l'email che la password

source: Invalid email format
it: Formato email non valido

source: Invalid email or password
it: Email o password non validi

source: You have been disconnected
it: Sei stato disconnesso

source: Missing email or password
it: Email o password mancanti

source: Login successful
it: Login effettuato con successo

source: Doctor not found
it: Medico non trovato

source: Authentication required
it: Autenticazione richiesta

source: You are not authorized to manage this patient
it: Non sei autorizzato a gestire questo paziente

source: Invalid platform name
it: Nome piattaforma non valido

source: Error generating platform link
it: Errore durante la generazione del link alla piattaforma

source: An error occurred
it: Si è verificato un errore

source: Invalid or expired link
it: Link non valido o scaduto

source: The link you are trying to use is invalid or has expired
it: Il link che stai cercando di utilizzare non è valido o è scaduto

source: This link has expired
it: Questo link è scaduto

source: The link you are trying to use has expired
it: Il link che stai cercando di utilizzare è scaduto

source: This link has already been used
it: Questo link è già stato utilizzato

source: The link you are trying to use has already been used
it: Il link che stai cercando di utilizzare è già stato usato

source: Invalid session
it: Sessione non valida

source: Your session is invalid or has expired
it: La tua sessione non è valida o è scaduta

source: Unsupported platform
it: Piattaforma non supportata

source: The platform you selected is not supported
it: La piattaforma selezionata non è supportata

source: Authentication failed: %(error)s
it: Autenticazione fallita: %(error)s

source: The health platform authentication failed
it: L'autenticazione alla piattaforma sanitaria è fallita

source: No authorization code received
it: Nessun codice di autorizzazione ricevuto

source: No authorization code was received from the health platform
it: Nessun codice di autorizzazione è stato ricevuto dalla piattaforma sanitaria

source: Invalid state parameter
it: Parametro di stato non valido

source: The state parameter is missing from the callback
it: Il parametro di stato è mancante dal callback

source: Invalid link
it: Link non valido

source: The link is invalid
it: Il link non è valido

source: The link has expired
it: Il link è scaduto

source: The link has already been used
it: Il link è già stato utilizzato

source: Failed to exchange authorization code for token
it: Impossibile scambiare il codice di autorizzazione per un token

source: Failed to exchange the authorization code for a token
it: Impossibile scambiare il codice di autorizzazione per un token

source: Successfully connected to Fitbit
it: Connessione a Fitbit riuscita

source: Your Fitbit account has been successfully connected
it: Il tuo account Fitbit è stato connesso con successo

source: Failed to save token data
it: Errore durante il salvataggio dei dati del token

source: Failed to save the token data
it: Errore durante il salvataggio dei dati del token

source: The platform is not supported
it: La piattaforma non è supportata

source: You are not authorized to view this patient's data
it: Non sei autorizzato a visualizzare i dati di questo paziente

source: Token has expired or been revoked
it: Il token è scaduto o è stato revocato

source: Incomplete token data
it: Dati del token incompleti

source: Not connected to any health platform
it: Non connesso a nessuna piattaforma sanitaria

source: Error checking connection status
it: Errore durante la verifica dello stato della connessione

source: You are not authorized to manage this patient's connections
it: Non sei autorizzato a gestire le connessioni di questo paziente

source: Invalid platform specified
it: Piattaforma specificata non valida

source: Patient is not connected to the specified platform
it: Il paziente non è connesso alla piattaforma specificata

source: Successfully disconnected from health platform
it: Disconnessione dalla piattaforma sanitaria avvenuta con successo

source: Error disconnecting from health platform
it: Errore durante la disconnessione dalla piattaforma sanitaria

source: Patient is not connected to any health platform
it: Il paziente non è connesso a nessuna piattaforma sanitaria

source: Invalid start date format. Use ISO format (YYYY-MM-DD)
it: Formato data iniziale non valido. Usa il formato ISO (YYYY-MM-DD)

source: Invalid end date format. Use ISO format (YYYY-MM-DD)
it: Formato data finale non valido. Usa il formato ISO (YYYY-MM-DD)

source: Missing JSON data in request
it: JSON mancante nella richiesta

source: Required field missing: %(field)s
it: Campo obbligatorio mancante: %(field)s

source: Specific Report
it: Report Specifico

source: Generated on
it: Generato il

source: Patient Information
it: Informazioni Paziente

source: Name
it: Nome

source: Date of Birth
it: Data di Nascita

source: Gender
it: Sesso

source: Not specified
it: Non specificato

source: Contact
it: Contatto

source: Not provided
it: Non fornito

source: Attending Physician
it: Medico Curante

source: General Practice
it: Medicina Generale

source: Summary
it: Riepilogo

source: Clinical Notes
it: Note Cliniche

source: Vital Signs
it: Parametri Vitali

source: 1 Day
it: 1 Giorno

source: 7 Days
it: 7 Giorni

source: 1 Month
it: 1 Mese

source: 3 Months
it: 3 Mesi

source: days
it: giorni

source: No vital data available for this period.
it: Nessun parametro vitale disponibile per questo periodo

source: Observations
it: Osservazioni

source: Page
it: Pagina

source: The password must be at least 8 characters long
it: La password deve contenere almeno 8 caratteri

source: The password must contain at least one uppercase letter
it: La password deve contenere almeno una lettera maiuscola

source: The password must contain at least one lowercase letter
it: La password deve contenere almeno una lettera minuscola

source: The password must contain at least one digit
it: La password deve contenere almeno una cifra

source: The password must contain at least one special character
it: La password deve contenere almeno un carattere speciale

source: The password is strong
it: La password è forte

source: Invalid date format. Please use YYYY-MM-DD
it: Formato data non valido. Utilizzare YYYY-MM-DD

source: Name, surname and date of birth are mandatory fields
it: Nome, cognome e data di nascita sono campi obbligatori

source: Patient %(first_name)s %(last_name)s successfully created with ID %(uuid)s
it: Paziente %(first_name)s %(last_name)s creato con successo con ID %(uuid)s

source: Invalid date format. Use YYYY-MM-DD
it: Formato data non valido. Utilizzare YYYY-MM-DD

source: An error occurred while creating the patient
it: Si è verificato un errore durante la creazione del paziente

source: You are not authorized to view this patient.
it: Non sei autorizzato a visualizzare questo paziente

source: You are not authorized to modify this patient.
it: Non sei autorizzato a modificare questo paziente

source: First name, second name and date of birth are mandatory fields
it: Nome, cognome e data di nascita sono campi obbligatori

source: Patient information updated successfully
it: Paziente aggiornato con successo

source: An error occurred while updating the patient
it: Si è verificato un errore durante l'aggiornamento del paziente

source: You are not authorized to delete this patient.
it: Non sei autorizzato ad eliminare questo paziente

source: Patient successfully removed
it: Paziente rimosso con successo

source: An error occurred while removing the patient
it: Si è verificato un errore durante la rimozione del paziente

source: You are not authorized to view this patient
it: Non sei autorizzato a visualizzare questo paziente

source: Not authorized
it: Non autorizzato

source: No health platform connection
it: Nessuna connessione alla piattaforma sanitaria

source: You are not allowed to add notes for this patient
it: Non sei autorizzato ad aggiungere note per questo paziente

source: Profile updated successfully
it: Profilo aggiornato con successo

source: The current password is incorrect
it: La password attuale non è corretta

source: New passwords do not match
it: Le nuove password non corrispondono

source: Password updated successfully
it: Password aggiornata con successo

source: You are not authorized to generate reports for this patient
it: Non sei autorizzato a generare report per questo paziente

source: Error generating specific report: %(error)s
it: Errore durante la generazione del report specifico: %(error)s

source: Audit Logs
it: Log di Audit

source: Back to Dashboard
it: Ritorna a Dashboard

source: Filter Logs
it: Filtra Log

source: Start Date
it: Data Inizio

source: End Date
it: Data Fine

source: Action Type
it: Tipo Azione

source: All Actions
it: Tutte le Azioni

source: Create
it: Crea

source: Update
it: Aggiorna

source: Delete
it: Elimina

source: View
it: Visualizza

source: Export
it: Esporta

source: Generate Link
it: Genera Link

source: Connect
it: Connetti

source: Disconnect
it: Disconnetti

source: Sync
it: Sincronizza

source: Entity Type
it: Tipo Entità

source: All Entities
it: Tutte le Entità

source: Patient
it: Paziente

source: Note
it: Nota

source: Health Platform
it: Piattaforma Sanitaria

source: Observation
it: Osservazione

source: Doctor
it: Dottore

source: All Doctors
it: Tutti i Dottori

source: All Patients
it: Tutti i Pazienti

source: Clear Filters
it: Rimuovi Filtri

source: Apply Filters
it: Applica Filtri

source: Audit History
it: Cronologia Audit

source: Date & Time
it: Data & Ora

source: User
it: Utente

source: Action
it: Azione

source: Entity
it: Entità

source: IP Address
it: Indirizzo IP

source: Details
it: Dettagli

source: View Details
it: Visualizza Dettagli

source: Audit Log Details
it: Dettagli del Registro di Audit

source: Entity ID
it: ID Entità

source: Close
it: Chiudi

source: No audit logs found matching your criteria
it: Nessun registro di Audit trovato che corrisponda ai tuoi criteri

source: Actions by Type
it: Azioni per Tipo

source: Entities by Type
it: Entità per Tipo

source: Activity Timeline
it: Azioni nel Tempo

source: Number of Actions
it: Numero di Azioni

source: Language
it: Lingua

source: VitaLink. All rights reserved.
it: VitaLink. Tutti i diritti riservati

source: Patients
it: Pazienti

source: Profile
it: Profilo

source: Healthcare Monitoring Platform
it: Piattaforma di Monitoraggio Sanitario

source: Total patients under your care
it: Numero di pazienti sotto la tua cura

source: View all patients
it: Visualizza tutti i pazienti

source: Quick Actions
it: Azioni Rapide

source: Manage your patients and vital signs
it: Gestisci i tuoi pazienti e i parametri vitali

source: New Patient
it: Nuovo Paziente

source: Search Patients
it: Cerca Pazienti

source: Monitor changes and actions in the system
it: Monitora le modifiche e le azioni nel sistema

source: View activity logs
it: Visualizza i log delle attività

source: System Status
it: Stato del sistema

source: Active
it: Attivo

source: All systems operational
it: Tutti i Sistemi Operativi

source: Last updated
it: Ultimo aggiornamento

source: Recent Patients
it: Pazienti Recenti

source: View All
it: Visualizza Tutto

source: Added
it: Aggiunto

source: Actions
it: Azioni

source: No patients added yet
it: Nessun paziente aggiunto finora

source: Recent Activities
it: Attività Recenti

source: Time
it: Ora

source: No activities recorded yet
it: Nessuna attività registrata finora

source: Connect Health Platform
it: Connetti Piattaforma Sanitaria

source: Health Connection Request
it: Richiesta di Connessione alla Piattaforma Sanitaria

source: Hello
it: Ciao

source: Your doctor has requested to connect to your health data to monitor your health status.
it: Il tuo medico ha richiesto di connettersi ai tuoi dati sanitari per monitorare il tuo stato di salute

source: This link is valid for 24 hours and can only be used once.
it: Questo link è valido per 24 ore e può essere utilizzato solo una volta

source: Expires at:
it: Scade il:

source: Connect your Fitbit account to share your health and activity data.
it: Connetti il tuo account Fitbit per condividere i tuoi dati sanitari e di attività

source: Connect Fitbit
it: Connetti Fitbit

source: Connect your Google Health Connect account to share your health and activity data.
it: Connetti il tuo account Google Health Connect per condividere i tuoi dati sanitari e di attività

source: Connect Google Health Connect
it: Connetti Google Health Connect

source: Connect your Apple Health account to share your health and activity data.
it: Connetti il tuo account Apple Health per condividere i tuoi dati sanitari e di attività

source: Connect Apple Health
it: Connetti Apple Health

source: Privacy Information
it: Informativa sulla Privacy

source: Your health data will only be visible to your healthcare provider. You can revoke access at any time by disconnecting your account from your health platform settings.
it: I tuoi dati sanitari saranno visibili solo al tuo fornitore di assistenza sanitaria. Puoi revocare l'accesso in qualsiasi momento disconnettendo il tuo account dalle impostazioni della piattaforma connessa

source: Health Platform Connection
it: Connessione alla Piattaforma Sanitaria

source: Connection Successful
it: Connessione Riuscita

source: Connection Failed
it: Connessione Fallita

source: Your health platform was successfully connected!
it: La tua piattaforma sanitaria è stata connessa con successo!

source: You can now close this window.
it: Adesso puoi chiudere questa finestra

source: There was an error connecting your health platform
it: C'è stato un errore durante la connessione alla piattaforma sanitaria

source: Please try again or contact your healthcare provider.
it: Riprova o contatta il tuo fornitore di assistenza sanitaria

source: Go Back
it: Torna Indietro

source: Login
it: Accedi

source: Healthcare Monitor
it: Monitor Sanitario

source: Email address
it: Indirizzo Email

source: New doctor? Register here
it: Nuovo medico? Registrati Qui

source: This is a secure platform for healthcare professionals only.
it: Questa è una piattaforma sicura solo per professionisti sanitari

source: Unauthorized access is strictly prohibited.
it: L'accesso non autorizzato è severamente proibito

source: DOB
it: DDN

source: Age
it: Età

source: Back to Patients
it: Ritorna a Pazienti

source: Contact Information
it: Numero di Telefono

source: No email provided
it: Nessuna email fornita

source: Address
it: Indirizzo

source: No address provided
it: Nessun indirizzo fornito

source: Registration Information
it: Informazioni di Registrazione

source: Added on
it: Aggiunto il

source: Patient Actions
it: Azioni Paziente

source: View Vital Signs
it: Visualizza Parametri Vitali

source: Edit Patient Information
it: Modifica Informazioni Paziente

source: Delete Patient Record
it: Elimina Record Paziente

source: Medical Notes
it: Note mediche

source: Add Note
it: Aggiungi Nota

source: Delete Note
it: Elimina Nota

source: No notes have been added yet
it: Nessuna nota è stata aggiunta finora

source: Add First Note
it: Aggiungi Prima Nota

source: Note Content
it: Contenuto Nota

source: Enter your medical observations, treatment plans, or other relevant information.
it: Inserisci le tue osservazioni mediche, piani di trattamento o altre informazioni pertinenti

source: Cancel
it: Annulla

source: Save Note
it: Salva Nota

source: Confirm Deletion
it: Conferma Eliminazione

source: Are you sure you want to delete this note?
it: Sei sicuro di voler eliminare questa nota?

source: Add New Patient
it: Aggiungi Nuovo Paziente

source: Edit Patient
it: Modifica Paziente

source: First name is mandatory
it: Il nome è obbligatorio

source: Surname
it: Cognome

source: Second name is mandatory
it: Il cognome è obbligatorio

source: Date of birth
it: Data di Nascita

source: Date of birth is mandatory
it: La data di nascita è obbligatoria

source: Male
it: Maschio

source: Female
it: Femmina

source: Other
it: Altro

source: Prefer not to say
it: Preferisco non rispondere

source: Contact Number
it: Numero di Telefono

source: Save Patient
it: Salva Paziente

source: Back to Patient
it: Ritorna a Paziente

source: Second name
it: Cognome

source: Phone Number
it: Numero di Telefono

source: Update Patient
it: Aggiorna Paziente

source: Add new Patient
it: Aggiungi nuovo Paziente

source: Import Patient by UUID
it: Importa Paziente tramite UUID

source: Patient UUID
it: UUID paziente

source: Enter patient UUID...
it: Inserisci UUID paziente...

source: Enter the UUID of the patient you want to import. The patient will be linked to your account.
it: Inserisci l'UUID del paziente che desideri importare. Il paziente sarà collegato al tuo account

source: Import Patient
it: Importa Paziente

source: Search by name or ID...
it: Cerca per nome o ID...

source: View Patient
it: Visualizza Paziente

source: View Vitals
it: Visualizza Parametri Vitali

source: Delete Patient
it: Elimina Paziente

source: No patient found
it: Nessun paziente trovato

source: No patients match your search
it: Nessun paziente corrisponde alla tua ricerca

source: Your Profile
it: Il tuo Profilo

source: Account Information
it: Informazioni Account

source: Email Address
it: Indirizzo Email

source: You cannot change your email address
it: Non puoi cambiare il tuo indirizzo email

source: Update Profile
it: Aggiorna Profilo

source: Change Password
it: Cambia Password

source: Current Password
it: Password Corrente

source: New Password
it: Nuova Password

source: Password must be at least 8 characters and include uppercase and special characters and a number.
it: La password deve contenere almeno 8 caratteri e includere lettere maiuscole e caratteri speciali e numeri.

source: Confirm New Password
it: Conferma Nuova Password

source: Register
it: Registrati

source: Doctor Registration
it: Registrazione Medico

source: We'll never share your email with anyone else.
it: Non condivideremo mai la tua email con nessun altro.

source: Medical Specialty
it: Specializzazione Medica

source: Create Account
it: Crea Account

source: Already have an account?
it: Hai già un account?

source: Login here
it: Accedi Qui

source: Generate Patient Report
it: Genera Report Paziente

source: Create Custom Report
it: Crea Report Personalizzato

source: Summary (Optional)
it: Riepilogo (Facoltativo)

source: Add an optional summary for this report. It will appear in the report but will not be saved in the database.
it: Aggiungi un riepilogo facoltativo per questo report. Apparirà nel report ma non sarà salvato nel database

source: This summary will only be included in this report and will not be saved.
it: Questo riepilogo sarà incluso solo in questo report e non sarà salvato

source: REPORT CONTENTS
it: CONTENUTO DEL REPORT

source: Select All
it: Seleziona Tutti

source: Deselect
it: Deseleziona

source: No notes available
it: Nessuna nota disponibile

source: No observations available
it: Nessuna osservazione disponibile

source: CHARTS AND VITAL PARAMETERS
it: GRAFICI E PARAMETRI VITALI

source: Vital Parameters
it: Parametri Vitali

source: All
it: Tutti

source: None
it: Nessuno

source: Select at least one period
it: Seleziona almeno un periodo

source: Generate PDF Report
it: Genera Report PDF

source: Loading...
it: Caricamento...

source: Checking connection status...
it: Verifica stato connessione...

source: Connected to Health Platform
it: Connesso alla Piattaforma sanitaria

source: This patient has an active connection to their health platform.
it: Questo paziente ha una connessione attiva alla sua piattaforma sanitaria.

source: Connected Platform
it: Piattaforma Connessa
